Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: སུ་ལ་ཡང་ཅུང་ཟད་ཀྱང་སྨྲ་བ་མ་ཕོད་དོ། །
en: To speak to anyone was more than she could bear.

source: དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས་དེའི་ཚེ།
en: “O monks, what do you think?

source: རྒན་མོར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཚོན་མོ་དགའ་མོ་འདི་ཉིད་ཡིན་ནོ། །
en: The one who was the old woman then is none other than Sthūlanandā.

source: དེའི་ཚེ་ཤིང་མཁན་དུ་གྱུར་པ་དེ་དག་ནི་དྲུག་སྡེ་འདི་དག་ཉིད་ཡིན་ཏེ།
en: Those who were the carpenters then are none other than the Band of Six.

source: དེའི་ཚེ་ཡང་འདི་དེ་དག་གིས་བྲིད་ནས་དོན་དེ་མ་གྲུབ་བོ། །
en: They deceived her then, and she did not accomplish her aims.

source: ད་ལྟར་ཡང་འདི་དེ་དག་གིས་བྲིད་ནས་འདི་རྫུ་འཕྲུལ་ཡང་མ་གྲུབ་པ་ཡིན་ནོ།། །།
en: Now they have deceived her once again, and she has not performed any miracles.”

source: འཆར་ཀ་ཞེས་བྱ་བ་ནི།
en: The Story of Udayin

source: རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེ་དེར་གང་གི་ཚེ། ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནསདགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་པ་དེའི་ཚེ་དེས་བསམས་པ།
en: When the Blessed One was in Rājagṛha, Venerable Piṇḍola­bhāradvāja, who had cast away all afflictions and manifested arhatship, thought,

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདག་གི་སྡུག་བསྔལ་དང་ཡིད་མི་བདེ་བ་རྣམ་པ་དུ་མ་ནི་བསལ། བདེ་བ་དང་ཡིད་བདེ་བ་རྣམ་པ་དུ་མ་ནི་བསྒྲུབས། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམ་པ་དུ་མ་ནི་བསལ། དགེ་བའི་ཆོས་རྣམ་པ་དུ་མ་ནི་བསྒྲུབས་ན།
en: “The Blessed One has dispelled so many kinds of suffering and anguish, brought me many kinds of happiness and bliss, cleared away so many of my sins and nonvirtues, and secured for me such virtues.

source: བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་བཀའ་དྲིན་ཇི་ལྟར་བསབ་པར་བྱ་སྙམ་མོ། །
en: How could I repay the Blessed One’s kindness?”

source: དེ་ནས་དེས་བསམས་པ་
en: Then it occurred to him,

source: སངས་རྒྱས་འཇིག་རྟེན་དུ་འབྱུང་བ་གང་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི་སེམས་ཅན་ལ་ཕན་པའི་ཕྱིར་འབྱུང་བར་ཟད་ཀྱིས།
en: “Anytime a buddha arises in the world, it is only to benefit beings.

source: མ་ལ་བདག་གིས་ཀྱང་སེམས་ཅན་ལ་ཕན་པར་བྱ་གོར་མ་ཆག་སྙམ་ནས་
en: There’s no doubt that I too should act for the benefit of beings!”

source: དེས་བསམས་པ། བདག་གིས་གདུལ་བར་བྱ་བ་འགའ་ལྟ་ཡོད་དམ་སྙམ་པ་དང་།
en: With this in mind, he wondered, “Whom might I tame?”

source: དེས་ཡུལ་ཀཽ་ཤཱཾ་བཱི་ན་གནས་པའི་སྐྱེ་བོ་ཕལ་ཆེར་བདག་གིས་གདུལ་བར་འགྱུར་བ་མཐོང་ནས
en: He saw that he could tame many in Kauśāmbī,

source: ཇི་སྲིད་དགའ་བའི་བར་དུ་རྒྱལ་པོའི་ཁབ་ཏུ་གནས་ནས་དེས་ཤམ་ཐབས་དང་ཆོས་གོས་བགོས་ཏེ། ལྷུང་བཟེད་ཐོགས་ནས་ཡུལ་ཀཽ་ཤཱཾ་བཱི་ན་ག་ལ་བ་དེར་རྒྱུ་ཞིང་སོང་སྟེ་
en: so after staying in Rājagṛha for as long as he liked, he donned his lower garment and Dharma robes, and, carrying his alms bowl, went to Kauśāmbī for alms.

source: དེ་མཐར་གྱིས་རྒྱུ་ཞིང་སོང་བ་ལས་ཡུལ་ཀཽ་ཤཱཾ་བཱིར་ཕྱིན་ནས། ཀཽ་ཤཱཾ་བཱི་ན་ཁྱིམ་བདག་གདངས་ལས་རིག་གི་ཀུན་དགའ་ར་བ་ན་གནས་སོ། །
en: He eventually arrived at Kauśāmbī, where he stayed in the garden of the householder Ghoṣila.

source: ཚེ་དང་ལྡན་པ་དེ་ཡང་བསོད་ནམས་ཆེན་པོ་དང་ལྡན་པ། མདུན་ན་འདོན་གྱི་བུ་ལས་རབ་ཏུ་བྱུང་བ་ཡིན་ནོ་ཞེས་གྲགས་སོ། །
en: Now this monk was also a person of great merit, and was widely known for having gone from being a son of the royal family priest to being a monk.

source: དེ་ནས་ཀཽ་ཤཱཾ་བཱི་ན་གནས་པའི་སྐྱེ་བོ་མང་པོས་འཕགས་པ་པིཎྜོ་ལ་བ་ར་དྷཱ་ཛ་ལྗོངས་རྒྱུ་ཞིང་ཡུལ་ཀཽ་ཤཱཾ་བཱིར་འོངས་ཏེ། ཀཽ་ཤཱཾ་བཱི་ན་ཁྱིམ་བདག་གདངས་ལས་རིག་གི་ཀུན་དགའ་ར་བ་ན་འདུག་གོ་ཞེས་ཐོས་སོ། །
en: Many people in Kauśāmbī had heard that Noble Piṇḍola­bhāradvāja was traveling through the countryside and had now come to the city of Kauśāmbī, where he was staying in the garden of the householder Ghoṣila.

source: ཐོས་ནས་ཀྱང་ཚོགས་ནས་ཚོགས་དང་སྡེ་ཚན་ནས་སྡེ་ཚན་དུ་འདུས་ཤིང་ཚོགས་ཏེ། ཀཽ་ཤཱཾ་བཱི་ནས་བྱུང་ནས།
en: Upon hearing this they gathered—group after group and elder after elder—and convened in Kauśāmbī.

source: ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛ་ག་ལ་བ་དེར་སོང་སྟེ་ལྷགས་ནས། ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་མདུན་དུ་འཁོད་དོ། །
en: They approached Venerable Piṇḍola­bhāradvāja, and upon their arrival they gathered together, bowed down at Venerable Piṇḍola­bhāradvāja’s feet, and sat before him to listen to the Dharma.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛས། དེ་དག་གི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་རང་བཞིན་རྟོགས་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ
en: Then Venerable Piṇḍola­bhāradvāja, directly apprehending their thoughts, habitual tendencies, temperaments, and natures, taught them the Dharma accordingly.

source: ཀཽ་ཤཱཾ་བཱི་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་འདུས་པ་རྣམས་ཀྱིས་སྟན་དེ་ཉིད་ལ་འཁོད་བཞིན་དུ་ཁ་ཅིག་གིས་ནི་དྲོ་བར་གྱུར་པ་བསྐྱེད་དོ། །
en: As soon as they heard it, some of the inhabitants of Kauśāmbī who had gathered there generated heat.

source: ཁ་ཅིག་གིས་ནི་སྤྱི་བོ་དང་བདེན་པ་དང་འཐུན་པའི་བཟོད་པ་དང་འཇིག་རྟེན་གྱི་ཆོས་ཀྱི་མཆོག་དང་མཐོང་བའི་སྙོམས་པར་འཇུག་པ་བསྐྱེད་དོ། །
en: Some generated the peak, or generated the patience in accord with the truths, or generated the highest worldly dharma, or generated the attainment of seeing, right where they sat.

source: ཁ་ཅིག་གིས་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ། །
en: Some manifested the resultant state of stream entry.

source: ཁ་ཅིག་གིས་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ། །
en: Some manifested the resultant state of once-return.

source: ཁ་ཅིག་གིས་ནི་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ། །
en: Some manifested the resultant state of non-return.

source: ཁ་ཅིག་གིས་ནི་རབ་ཏུ་བྱུང་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: Some went forth and manifested arhatship.

source: ཁ་ཅིག་གིས་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་བའི་ས་བོན་བསྐྱེད་དོ། །ཁ་ཅིག་གིས་ནི་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་བ་དང་། ཁ་ཅིག་གིས་ནི་བརྒྱ་བྱིན་དུ་འགྱུར་བ་དང་། ཁ་ཅིག་གིས་ནི་ཚངས་པར་འགྱུར་བ་དང་། ཁ་ཅིག་གིས་ནི་ཉན་ཐོས་ཀྱི་བྱང་ཆུབ་དང་། ཁ་ཅིག་གིས་ནི་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་དང་། ཁ་ཅིག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ས་བོན་བསྐྱེད་དོ། །
en: Some sowed the seeds to become universal monarchs, some to become great universal monarchs, some to become Indra, some to become Brahmā, some for the enlightenment of the listeners, some for the enlightenment of the solitary buddhas, and some for unexcelled, total, and complete enlightenment.

source: འཁོར་དེ་དག་གི་ནང་ནས་ཕལ་ཆེར་ནི་སངས་རྒྱས་ལ་གཞོལ་ཆོས་ལ་འབབ། དགེ་འདུན་ལ་བབ་པར་བྱས་ཏེ་བཀོད་དོ། །
en: Among the assembled, most found themselves drawn to the Buddha, intent on the Dharma, and favoring the Saṅgha.

source: དེ་དག་གིས་བདེན་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Having seen the truths, they rose from their seats, drew down the right shoulder of their upper garments, bowed toward Venerable Piṇḍola­bhāradvāja with palms pressed together, and beseeched him,

source: འཕགས་པ་ལས་བརྟེན་ཏེ་བདག་ཅག་སེམས་ཅན་དམྱལ་བ་དང་དུད་འགྲོ་དང་ཡི་དགས་རྣམས་ལས་བཏོན་ནས།
en: “After we entrusted ourselves to you, noble one, you lifted us up from among the hell beings, animals, and anguished spirits.

source: ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་གོམ་པ་འདོར་དུ་བཅུག་སྟེ། ཁྲག་དང་མཆི་མའི་རྒྱ་མཚོ་ནི་སྐམས། རུས་པའི་ལ་ནི་བསྒྲལ། ཐོག་མ་མེད་པ་ནས་གོམས་པའི་ཉོན་མོངས་པ་དེ་དག་ནི་བོར་ཏེ་བསལ་ཏོ། །
en: Leading us to live among the gods and humans, you dried up the ocean of blood and tears and led us over the mountain pass of bones to cast away all the afflictive emotions to which we have been accustomed since beginningless time.

source: འཕགས་པ་བདག་ཅག་ཇི་སྲིད་འཚོའི་བར་དུ་བདག་ཅག་ལས་ཞལ་ཟས་དང་ན་བཟའ་དང་གཟིམས་ཆ་དང་གདན་དང་སྙུན་གསོས་དང་སྨན་ཟོང་རྣམས་བཞེས་པར་ཅི་གནང་ཞེས་བྱས་སོ། །
en: Noble one, for as long as we live, please accept from us your provisions of clothing, food, bedding, a seat, and medicines for the sick.”

source: ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛས་སྨྲས་པ།
en: replied Venerable Piṇḍola­bhāradvāja,

source: གྲོགས་པོ་
en: “Friends,”

source: དག་གཞན་དག་ལ་ཡང་ཕན་གདགས་དགོས་ཀྱིས་ཐོང་ཤིག །
en: “there are other householders I must help as well. Please allow me to go.”

source: དེ་ནས་ཀཽ་ཤཱཾ་བཱི་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་རྣམས། ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛས་སྨྲས་པ་ལ་མངོན་པར་བསྟོད་དེ་རྗེས་སུ་ཡི་རང་ནས། ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་དོང་ངོ་། །
en: The inhabitants of Kauśāmbī who had gathered there rejoiced at what Venerable Piṇḍola­bhāradvāja had said to them, touched their heads to Venerable Piṇḍola­bhāradvāja’s feet, and departed.

source: དེ་ནས་བདེན་པ་མཐོང་བ་དེ་དག་དུས་དུས་སུ་ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛའི་ཐད་དུ་འདོང་ཞིང་ཆོས་ཉན་ཏོ། །
en: From time to time those who had seen the truths would visit Venerable Piṇḍola­bhāradvāja and listen to the Dharma.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཀཽ་ཤཱཾ་བཱི་ན་གནས་པའི་ཚོགས་ནས་ཚོགས་དང་འདུས་པ་ནས་འདུས་པའི་སྐྱེ་བོའི་ཚོགས་རྣམས། འདུས་ཤིང་ཚོགས་ཏེ་འདོང་བར་བྱེད་ལ། བད་སའི་རྒྱལ་པོ་འཆར་ཀ་ཡང་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གོ་བསྐོན་ནས་རི་དགས་ཤོར་དུ་དོང་བ་དང་།
en: One day, as those living in Kauśāmbī were gathering together—group after group and elder after elder—King Udayin of Vatsa arrayed the four divisions of his army and set out to hunt deer.

source: བད་སའི་རྒྱལ་པོ་འཆར་ཀས། ཀཽ་ཤཱཾ་བཱི་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་རྣམས། ཁྱིམ་བདག་གདངས་ལས་རིག་གི་ཀུན་དགའ་ར་བར་འདོང་བ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བློན་པོ་རྣམས་ལ་དྲིས་པ།
en: When King Udayin of Vatsa saw the assembly of those living in Kauśāmbī going to the garden of the householder Ghoṣila, he immediately asked his ministers,

source: ཡུལ་མི་འདི་དག་གར་འདོང་བློན་པོ་རྣམས་ཀྱིས་གསོལ་པ།
en: “Where are these country folk going?”

source: ལྷ་མདུན་ན་འདོན་གྱི་བུ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛ་ཞེས་བགྱི་བ་ཞིག་མཆིས་པ་དེས་ཁྱིམ་དང་ཅོད་པན་མ་མཆིས་པའི་རྒྱལ་སྲིད་བོར་ནས་རབ་ཏུ་བྱུང་སྟེ
en: “Deva,” the ministers replied, “the child of your family priest, the one called Piṇḍola­bhāradvāja, has cast aside the royal concerns of home and crown and gone forth.

source: དེ་ལྗོངས་རྒྱུ་ཞིང་མཆིས་པ་ལས་ཀཽ་ཤཱཾ་བཱིར་མཆིས་ནས། ཀཽ་ཤཱཾ་བཱི་ན་ཁྱིམ་བདག་གདངས་ལས་རིག་གི་ཀུན་དགའ་ར་བ་ན་གནས་ཏེ།
en: He has now made his way through the countryside to Kauśāmbī, where he is staying in the garden of the householder Ghoṣila.

source: འདི་དག་ནི་དེ་ལ་བལྟ་བའི་སླད་དུ་མཆིས་པ་ལགས་སོ། །
en: It is him they are traveling to see.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོས་སྨྲས་པ།
en: As soon as he heard this, the king declared,

source: དེ་ནི་ངའི་ཡང་ཡུན་རིང་པོ་ནས་སྙིང་དུ་སྡུག་པ་དང་ཡིད་དུ་འོང་བ་དང་མཁན་པོ་དང་དྲན་པར་བྱ་བ་ཡིན་གྱིས་ང་ཡང་དེ་ལ་བལྟ་བ་དང་།
en: “For a long time he has pleased me and been dear to my heart, and it is my duty to pay tribute to a preceptor.

source: བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འགྲོ་ཞེས་བྱས་ནས
en: I will also go to see him and pay him respect.”

source: ཁྱིམ་བདག་གདངས་ལས་རིག་གི་ཀུན་དགའ་ར་བ་ག་ལ་བ་དེར་སོང་བ་དང་། གནས་བརྟན་དེས་རྒྱལ་པོ་བསུ་ཡང་མ་བསུ་ལངས་ཀྱང་མ་ལངས་སོ། །
en: They went to the householder Ghoṣila’s garden, but the elder monk did not receive the king, nor did he so much as stand.

source: དེ་ནས་མཐོང་མ་ཐག་ཏུ་རྒྱལ་པོ་ཁྲོ་བའི་ཀུན་ནས་དཀྲིས་པ་ཆེན་པོས་ནོན་ཏེ།
en: When the king saw this, he was instantly consumed with fury.

source: ཁྲོས་ནས་གནས་བརྟན་ལ་བསྙེན་བཀུར་བྱས་ཏེ་སོང་ངོ་། །
en: Seething with anger, he paid respect to the elder monk and then departed.

source: དེ་ནས་དེས་བློན་པོ་རྣམས་ལ་སྨྲས་པ།
en: He said to his ministers,

source: ཁྱེད་ཀྱིས་ངའི་ཡུལ་ན་འདུག་པའི་མདུན་ན་འདོན་གྱི་བུ་རབ་ཏུ་བྱུང་བ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛ་འདི་ལ་ལྟོས་དང་།
en: “Behold the renunciant Piṇḍola­bhāradvāja, the child of the country’s royal family priest!

source: ཁོས་ང་མཐོང་ན་བསུ་ཡང་མ་བསུ་ལངས་ཀྱང་མ་ལངས་སོ་ཞེས་བྱས་སོ། །
en: He saw me, but he would not receive me—he wouldn’t so much as stand!”

source: དེ་ནས་བློན་པོ་སྡང་བ་རྣམས་ཀྱིས་སྨྲས་པ།
en: To this his hateful ministers replied,

source: ལྷ་འདི་ལྟར་མཐོང་བ་བཞིན་དུ་མ་བསུ་བ་དང་མ་ལངས་པ་འདི་ནི་དེས་འཚམ་པར་བགྱིས་པ་མ་ལགས་སོ་ཞེས་བྱས་ནས།
en: “Deva, even though he saw you, he did not receive you, nor did he so much as stand! Such behavior is inappropriate.”

source: དེ་དག་གིས་རྒྱལ་པོ་དེ་ལྷག་པར་སྙིང་ན་བར་བྱས་ཏེ། གཞི་དེས་རྒྱལ་པོ་དེ་ལྷག་པར་ཡང་མི་དགའ་བར་གྱུར་ནས།
en: The king was heartbroken about this, and it made him extremely unhappy.

source: དེ་ཁྲོས་ཏེ་དཔུང་གི་ཚོགས་དེ་དག་དང་རི་དགས་ཤོར་དུ་སོང་ནས་ཕྱིར་ལོག་སྟེ་གཙུག་ལག་ཁང་དེ་ཉིད་ཀྱི་འདབ་ཏུ་སོང་ནས་བསམས་པ།
en: After hunting deer with his army, he returned to the area of the monastery in anger, thinking,

source: ང་དགེ་སློང་དེ་ལ་བལྟ་བའི་ཕྱིར་ཡང་སོང་ལ།
en: “Now I am going to go see that monk again.

source: གལ་ཏེ་དེས་ང་མཐོང་ན་ བསུ་ཡང་མི་བསུ་ལྡང་ཡང་མི་ལྡང་བར་གྱུར་ན་ནི། དེ་མགོ་བོ་བཅད་དེ་
en: When he sees me, if he does not receive me properly—if he does not so much as stand—I shall lop off his head and throw it away!”

source: དོར་རོ་སྙམ་དུ་བསམས་ནསདེ་ཁྱིམ་བདག་གདངས་ལས་རིག་གི་ཀུན་དགའ་ར་བར་ཡང་སོང་ངོ་། །
en: With this in mind, he entered the householder Ghoṣila’s garden.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛས་བད་སའི་རྒྱལ་པོ་འཆར་ཀ་བདག་ལ་བལྟ་བའི་ཕྱིར་ཡང་འོངས་སོ་ཞེས་ཐོས་སོ། །
en: Now Venerable Piṇḍola­bhāradvāja heard that King Udayin of Vatsa was on the way to see him, and as soon as he did, he thought,

source: དེ་ནས་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དེ་ཅིའི་ཕྱིར་ཡང་བདག་ལ་ལྟར་འོང་
en: “Why is King Udayin coming to see me again?”

source: སྙམ་དུ་བསམས་པ་དང་། དེས་གལ་ཏེ་དགེ་སློང་འདི་བདག་བསུ་བར་ཡང་མི་བྱེད་ལྡང་བར་ཡང་མི་བྱེད་པར་གྱུར་ནའདིའི་མགོ་འུད་པོར་བཅད་དེ་ས་ལ་དོར་རོ་སྙམ་དུ་སྡང་བའི་སེམས་ཀྱིས་འོངས་པར་དེས་མཐོང་སྟེ།
en: And he saw that the king was thinking, “If that monk fails to receive me properly upon sight—if he refuses even to stand—I shall lop off his head and toss it to the ground!”

source: དེས་རྒྱལ་པོ་དེའི་བསམ་པ་སེམས་ཀྱིས་ཤེས་ནས། ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཏེ་གོམ་པ་དྲུག་བོར་ནས་བསུ་བ་དང་།
en: Knowing the king’s thoughts, he rose from meditation and took six steps to receive him.

source: བསུ་བའི་མོད་ལ་རྒྱལ་པོ་དེའི་ལུས་ལས་འོད་འབྱུང་བ་དེ་མེད་པར་གྱུར་ཏེ་ས་ཡང་གས་སོ། །
en: As soon as he did so, the king’s air of splendor disappeared and a fissure appeared in the earth.

source: དེ་ནས་དེ་མཐོང་མ་ཐག་ཏུ་རྒྱལ་པོ་དེ་སྐྲག་ནས།
en: The king saw this and was immediately afraid.

source: དགེ་སློང་འདི་ནི་རྫུ་འཕྲུལ་ཆེ་བ་དང་མཐུ་ཆེ་བ་ཞིག་སྟེ།
en: “This monk is a person of great miracles and great power,” he thought.

source: བདག་འདི་ལ་སྡང་བའི་སེམས་ཀྱིས་སོང་བ་ལས་འདིའི་མཐུས་བདག་གི་འོད་མེད་པར་གྱུར་ལ་ས་ཡང་གས་པར་གྱུར་ཏོ་
en: “As I was approaching him with spiteful thoughts, through his power my splendor disappeared and the earth split open.”

source: སྙམ་དུ་རིག་ནས། ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛ་ག་ལ་བ་དེར་སོང་སྟེ་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་ སྨྲས་པ།
en: Sure of this, he approached Venerable Piṇḍola­bhāradvāja, bowed down at his feet, and said,

source: འཕགས་པ་བདག་བྱིས་པ་རྨོངས་པ་མི་གསལ་བ་མི་མཁས་པའི་ནོངས་པ་བཟོད་པར་གསོལ།
en: “Noble one, please forgive my childish, deluded, uncouth blunder.”

source: གནས་བརྟན་གྱིས་སྨྲས་པ།
en: the elder monk replied.

source: རྒྱལ་པོ་ཆེན་པོ་ངས་ནི་བཟོད་མོད་ཀྱི་རང་གི་སེམས་ལ་བཟོད་པ་གསོལ་ཅིག་ཅེས་བྱས་སོ། །
en: “Great King, I forgive you, but you must ask forgiveness of your own mind,”

source: རྒྱལ་པོས་སྨྲས་པ།
en: asked the king.

source: བཙུན་པ་བདག་རྒྱལ་སྲིད་ལས་ཉམས་པ་འམ་སྲོག་གི་བར་ཆད་དུ་མི་འགྱུར་ལགས་གྲང་།
en: “Lord, won’t my kingdom fall now? Won’t I lose my life?”

source: རྒྱལ་པོ་ཆེན་པོ་མ་སྐྲག་ཤིག་མ་སྐྲག་ཤིག །
en: “Never fear, Great King, never fear!”

source: ཁྱོད་རྒྱལ་སྲིད་ལས་ཀྱང་ཉམས་པར་མི་འགྱུར་ལ་སྲོག་གི་བར་ཆད་དུ་ཡང་མི་འགྱུར་རོ། །
en: “Your kingdom will not fall, nor will you lose your life.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་མོད་ཀྱི་བདག་གིས་ཁྱོད་ལ་གོམ་པ་དྲུག་བསུ་བ་དེས་ན་ཁྱོད་ཟླ་བ་དྲུག་གི་བར་དུ་རྒྱལ་སྲིད་སྟོར་བར་འགྱུར་ཏེ།
en: However, Great King, my taking six steps to receive you will cause you to lose your kingdom for six months.

source: ཟླ་བ་དྲུག་ལོན་ནས་ཕྱིར་ཡང་རྒྱལ་སྲིད་ཐོབ་པར་འགྱུར་རོ། །
en: Then, after six months have passed, you will regain your kingdom.

source: རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་བདག་ལ་སེམས་དགའ་བར་གྱིས་ཤིག་དང་།
en: Furthermore, Great King, you must feel joy toward me.

source: སེམས་དགའ་བར་བྱས་མ་ཐག་པ་དེས་ན་ཁྱོད་སའི་འོག་ཏུ་ནུབ་པར་མི་འགྱུར་ལ། ཁྱོད་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་ཡང་སླར་འབྱུང་བར་འགྱུར་རོ། །
en: For as soon as you feel joy toward me, you will prevent your fall into the earth, and your air of splendor will return.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོས་གནས་བརྟན་ལ་སེམས་དགའ་བ་བསྐྱེད་དེ། སེམས་དགའ་བ་བསྐྱེད་པའི་མོད་ལ་དེའི་འོད་ཀྱི་དཀྱིལ་འཁོར་ཡང་སླར་བྱུང་ལ་ས་གས་པ་ཡང་སླར་འབྱོར་བར་གྱུར་ཏོ། །
en: As soon as he heard this, the king felt joy toward the elder monk, and as soon as he felt this joy, his air of splendor returned and the fissure in the earth closed up.

source: དེ་ནས་རྒྱལ་པོ་དེ་གནས་བརྟན་ལ་ལྷག་པར་ཡང་དགའ་བར་གྱུར་ཏོ། །
en: At that moment the king again felt a surge of joy toward the elder monk.

source: དགའ་བར་གྱུར་ནས་གནས་བརྟན་གྱི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་གནས་བརྟན་གྱི་ཐད་ནས་སོང་ངོ་། །
en: Filled with such joy, he touched his head to the elder monk’s feet and departed.

source: དེ་ནས་ཕྱི་ཞིག་ན་བད་སའི་རྒྱལ་པོ་འཆར་ཀས་ཡང་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གོ་བསྐོན་ཏེ་རི་དགས་ཤོར་དུ་སོང་བ་དང་།
en: One day King Udayin of Vatsa again arrayed the four divisions of his army and set out to hunt deer.

source: དེ་རི་དགས་ཀྱིས་མིག་བླངས་ཏེ་སོང་ནས་དཔུང་གི་ཚོགས་ཀྱང་ལོགས་ཤིག་ཏུ་སོང་རྒྱལ་པོ་ཡང་ལོགས་ཤིག་ཏུ་སོང་སྟེ
en: They saw a deer and approached it, with the army on one side and the king on the other.

source: དེ་དཔུང་གི་ཚོགས་དང་བྲལ་ནས་འབྲོག་འཆོལ་ཏེ།
en: But on his way through the wilderness the king was separated from his army and became disoriented.

source: བ་ལང་གི་ལྷས་ཞིག་ཏུ་སོང་ནས་དེ་དེར་སུས་ཀྱང་ངོ་མ་ཤེས་ལ་དེས་ཀྱང་སུ་ཡང་ངོ་མི་ཤེས་ཏེ། དེ་མྱོས་ནས་དེ་ཟླ་བ་དྲུག་གི་བར་དུ་བ་ལང་གི་ལྷས་དེ་ཉིད་ན་འདུག་གོ། །
en: He wandered into a cattle pen and, not recognizing anyone or being recognized by anyone, he went mad, and remained there in the cattle pen for six months.

source: དེ་ནས་དེ་བུ་དང་བློན་པོ་དང་ཞམ་རིང་འཁོར་རྣམས་ཀྱིས་ཀྱང་བཙལ་བ་ལས་མ་རྙེད་ནས་
en: His children, ministers, and attendants all went looking for him, but were unable to find him.

source: སླར་རྒྱལ་པོའི་ཕོ་བྲང་དུ་འོང་སྟེ། བདག་ཅག་གིས་མ་རྙེད་ན་ཇི་ལྟར་བྱ། གར་སོང་ཞིག་གུ་སྙམ་ནས་ཁ་རོག་སྟེ་འཁོད་དོ། །
en: They returned to the royal palace wondering, “What shall we do now if we don’t find him? Where will we go?” And they sat in silence.

source: དེ་ནས་ཟླ་བ་དྲུག་ལོན་པ་དང་རྒྱལ་པོ་དེ་གཞན་གྱིས་མཐོང་ནས་ངོ་ཤེས་ཏེ་
en: Six months later someone recognized the king and asked,

source: ལྷ་ཁྱོད་ག་ལས་གཤེགས་ཏེ་འདིར་བྱོན་ཅེས་དྲིས་སོ། །
en: “Deva, what are you doing here?”

source: རྒྱལ་པོ་དེ་ཡང་སེམས་རྟས་ནས་དེས་བ་ལང་རྫི་དེ་ལ་ཇི་ལྟར་གྱུར་པ་ཐམས་ཅད་བསྙད་དོ། །
en: Coming to his senses, the king related to the cowherds all that had taken place.

source: བ་ལང་རྫིས་སྨྲས་པ།
en: the cowherds told him.

source: ལྷ་ཐུགས་རྟོན་ལ་སྤྲོ་བ་ཆེན་པོ་བསྐྱེད་དུ་གསོལ་དང་།
en: “Take heart, Deva,”

source: བདག་གིས་ཁྱོད་ཉིད་ཀྱི་ཕོ་བྲང་དུ་བསྐྱལ་ལོ་
en: “We shall bring you to the royal palace.”

source: བ་ལང་རྫི་དེས་རྒྱལ་པོ་དེ་ཁྲིད་དེ། ཀཽ་ཤཱཾ་བཱི་ལོགས་སུ་ཆས་སོ། །
en: The cowherds set out for Kauśāmbī with the king traveling separately behind them.

source: བློན་པོ་རིགས་པའི་མུན་འཛིན་གྱི་བུ་ཞེས་བྱ་བས་ཀྱང་ཟླ་བ་དྲུག་ལོན་པ་དང་ཡིད་ལ་དྲན་ཏེ་རྒྱལ་པོ་དེ་གར་གཤེགས་ཞིག་གུ་
en: After six months had passed, a minister named The Son of Enveloped in the Darkness of Logic remembered which direction the king had gone, and thought,

source: བདག་ཅག་གིས་བཙལ་དགོས་སོ། །
en: “We must search for him.

source: གལ་ཏེ་བདག་ཅག་གིས་གསོན་པོར་རྙེད་ན་ནི་དེ་ཉིད་རྒྱལ་པོ་མཛད་པར་ཟད་དོ། །
en: If we find him alive, he will carry on his reign.

source: དེ་མ་ཡིན་ཏེ་ནོངས་པར་གྱུར་ན་ནི་སྲས་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་གཞུག་གོ་
en: If not—if something went wrong—then we shall put his child on the throne.”

source: སྙམ་དུ་བསམས་ནས། དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ཏེ།
en: With this in mind, they organized the four divisions of the army.

source: གྲོང་དང་། གྲོང་རྡལ་དང་། གྲོང་ཁྱེར་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་དག་ཏུ་ཚོལ་དུ་དོང་བ་ལས། བློན་པོ་རིགས་པའི་མུན་འཛིན་གྱི་བུས་བད་སའི་རྒྱལ་པོ་འཆར་ཀ་ཐག་རིང་པོ་ནས་འོང་བ་མཐོང་ངོ་། །
en: As they searched the villages, towns, cities, kingdom, and royal palaces, The Son of Enveloped in the Darkness of Logic saw King Udayin of Vatsa from a distance.

source: མཐོང་ནས་ཀྱང་དགའ་ཆེས་ཏེ། བད་སའི་རྒྱལ་པོ་འཆར་ཀ་ག་ལ་བ་དེར་སོང་ནས་སྙུན་གསོལ་ཏེ།
en: Delighted to see him, he approached the king, inquired after his health, and asked him,

source: ལྷ་གང་དུ་གཤེགས་ཞེས་དྲིས་སོ། །
en: “Deva, where did you go?”

source: དེ་ནས་བད་སའི་རྒྱལ་པོ་འཆར་ཀས་ཇི་ལྟར་གྱུར་པ་རྒྱས་པར་བསྙད་དོ། །
en: whereupon King Udayin of Vatsa related the story in detail.

source: བློན་པོ་རིགས་པའི་མུན་འཛིན་གྱི་བུས་སྨྲས་པ།
en: said The Son of Enveloped in the Darkness of Logic,

source: ལྷ་
en: “Deva,”

source: འདི་ནི་འཕགས་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛས་ཇི་སྐད་དུ་ལུང་བསྟན་པ་ཐམས་ཅད་དེ་ཁོ་ན་བཞིན་དུ་གྱུར་པ་ལགས་སོ། །
en: “it is all just as Noble Piṇḍola­bhāradvāja prophesied.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དེ་གནས་བརྟན་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ནསདེས་བསམས་པ།
en: Hearing this, the king felt a surge of joy toward the elder monk and thought,

source: རེ་ཞིག་བདག་གྲོང་ཁྱེར་དུ་འགྲོ་བ་བཏང་ལ་འཕགས་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛ་དེ་ཉིད་ལ་བསྙེན་བཀུར་བྱའོ་སྙམ་དུ་བསམས་ནས།
en: “For now let me put off returning to the city. I will go and pay respect to Noble Piṇḍola­bhāradvāja.”

source: ཀཽ་ཤཱཾ་བཱིར་མ་སོང་བར་ཁྱིམ་བདག་གདངས་ལས་རིག་གི་ཀུན་དགའ་ར་བ་ག་ལ་བ་དེར་སོང་སྟེ།
en: With this in mind he bypassed Kauśāmbī and went to the householder Ghoṣila’s garden.

source: དེ་ཇི་སྲིད་དུ། བཞོན་པས་འགྲོ་བར་བྱ་བའི་ས་དེ་སྲིད་དུ་བཞོན་པས་སོང་ནས། བཞོན་པ་ལས་བབས་ཏེ་རྐང་པས་ཀུན་དགའ་ར་བར་སོང་ནས།
en: He traveled as far as he could by vehicle, then descended from his vehicle and continued to the garden on foot.

source: ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་མདུན་དུ་འདུག་གོ། །
en: There he approached Venerable Piṇḍola­bhāradvāja, bowed down at his feet, and sat before him to listen to the Dharma.

source: གནས་བརྟན་གྱིས་ཀྱང་དེ་ལ། དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏོ། །
en: The elder monk taught him a Dharma particularly suited to him.

source: དེ་ནས་བད་སའི་རྒྱལ་པོ་འཆར་ཀས་ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛའི་གཏམ་གྱི་མཇུག་རྫོགས་པར་རིག་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནསཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་སྨྲས་པ།
en: When Venerable Piṇḍola­bhāradvāja had completed his discourse, King Udayin of Vatsa rose from his seat, drew down the right shoulder of his upper garment, bowed toward Venerable Piṇḍola­bhāradvāja with his palms together, and implored him,

source: འཕགས་པ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་དགུང་བདུན་གྱི་བར་དུ་བདག་གི་དེར་བཤོས་གསོལ་བར་ཅི་གནང་ཞེས་བྱས་སོ། །
en: “Noble one, please permit me to request you and the saṅgha of monks to take your food at my house for seven days.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛས་བད་སའི་རྒྱལ་པོ་འཆར་ཀ་ལ་ཅང་མི་སྨྲ་བས་གནང་ངོ་། །
en: Venerable Piṇḍola­bhāradvāja assented by his silence.

source: དེ་ནས་བད་སའི་རྒྱལ་པོ་འཆར་ཀས། ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛས་ཅང་མི་སྨྲ་བས་གནང་བར་རིག་ནས་སྟན་ལས་ལངས་ཏེ་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛའི་ཐད་ནས་སོང་ངོ་། །
en: Understanding that by his silence Venerable Piṇḍola­bhāradvāja had given his assent, King Udayin of Vatsa rose from his seat, bowed down at Venerable Piṇḍola­bhāradvāja’s feet, and departed.

source: དེ་ནས་དེས་ཞག་བདུན་གྱི་བར་དུ་ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛ་འཁོར་དང་བཅས་པ་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ནས། ཐ་མའི་ཉིན་པར་རེ་རེ་ལ་ཡང་རས་ཟུང་རེ་ཕུལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་མདུན་དུ་འདུག་གོ། །
en: Once he had contented Venerable Piṇḍola­bhāradvāja and his retinue with many good, wholesome foods for seven days, at the end of the last day he offered each of them a set of robes fashioned from cotton and then sat before them to listen to the Dharma.

source: ཚེ་དང་ལྡན་པ་པིཎྜོ་ལ་བ་ར་དྷྭ་ཛས་ཀྱང་དེ་དང་འཐུན་པའི་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་བྱས་སོ། །
en: Venerable Piṇḍola­bhāradvāja instructed, encouraged, inspired, and delighted them with a discourse on the Dharma particularly suited to them.

source: ཆོས་ཀྱི་གཏམ་རྣམ་གྲངས་དུ་མས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་བྱས་ནས་སྟན་ལས་ལངས་ཏེ་སོང་ངོ་། །
en: After he had instructed, encouraged, inspired, and delighted them, he rose from his seat and departed.
